Giuko/OS_gruppoBESTie/qemu/include/hw/arm/s32k3xx_uart.h
#ifndef S32K3XX_UART_H
#define S32K3XX_UART_H

#define LPUART_BASE_ADDRESS 0x40328000
#define LPUART0_OFFSET      (0    * 1024)
#define LPUART1_OFFSET      (16   * 1024)
#define LPUART2_OFFSET      (32   * 1024)
#define LPUART3_OFFSET      (48   * 1024)
#define LPUART4_OFFSET      (64   * 1024)
#define LPUART5_OFFSET      (80   * 1024)
#define LPUART6_OFFSET      (96   * 1024)
#define LPUART7_OFFSET      (112  * 1024)
#define LPUART8_OFFSET      (1424 * 1024)
#define LPUART9_OFFSET      (1440 * 1024)
#define LPUART10_OFFSET     (1456 * 1024)
#define LPUART11_OFFSET     (1472 * 1024)
#define LPUART12_OFFSET     (1488 * 1024)
#define LPUART13_OFFSET     (1504 * 1024)
#define LPUART14_OFFSET     (1520 * 1024)
#define LPUART15_OFFSET     (1536 * 1024)

#define LPUART0 (LPUART_BASE_ADDRESS + LPUART0_OFFSET)
#define LPUART1 (LPUART_BASE_ADDRESS + LPUART1_OFFSET)
#define LPUART2 (LPUART_BASE_ADDRESS + LPUART2_OFFSET)
#define LPUART3 (LPUART_BASE_ADDRESS + LPUART3_OFFSET)
#define LPUART4 (LPUART_BASE_ADDRESS + LPUART4_OFFSET)
#define LPUART5 (LPUART_BASE_ADDRESS + LPUART5_OFFSET)
#define LPUART6 (LPUART_BASE_ADDRESS + LPUART6_OFFSET)
#define LPUART7 (LPUART_BASE_ADDRESS + LPUART7_OFFSET)
#define LPUART8 (LPUART_BASE_ADDRESS + LPUART8_OFFSET)
#define LPUART9 (LPUART_BASE_ADDRESS + LPUART9_OFFSET)
#define LPUART10 (LPUART_BASE_ADDRESS + LPUART10_OFFSET)
#define LPUART11 (LPUART_BASE_ADDRESS + LPUART11_OFFSET)
#define LPUART12 (LPUART_BASE_ADDRESS + LPUART12_OFFSET)
#define LPUART13 (LPUART_BASE_ADDRESS + LPUART13_OFFSET)
#define LPUART14 (LPUART_BASE_ADDRESS + LPUART14_OFFSET)
#define LPUART15 (LPUART_BASE_ADDRESS + LPUART15_OFFSET)

#define UART_SIZE           (16    * 1024)

#endif 
